IDEA StatiCa Open Model
OpenModelClassAttribute Constructor (String, String)
Compatible with IDEA StatiCa Beta 21.0 - beta
 Constructor
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public OpenModelClassAttribute(
	string structuralModelClassType,
	string structuralModelContainerType
)
Public Sub New (
	structuralModelClassType As String,
	structuralModelContainerType As String
)
public:
OpenModelClassAttribute(
	String^ structuralModelClassType,
	String^ structuralModelContainerType
)
Parameters
structuralModelClassType
Type: System.String
Equivalent SM type
structuralModelContainerType
Type: System.String
SM container type
See Also
Reference
OpenModelClassAttribute Class
OpenModelClassAttribute Overload
IdeaRS.OpenModel Namespace